In [35]:
"""1)Some important functions of pandas library are
        i-->.read_csv
        ii-->.head
        iii-->.describe
        iv-->.dtypes
        v-->.memory_usage"""

'1)Some important functions of pandas library are\n        i-->.read_csv\n        ii-->.head\n        iii-->.describe\n        iv-->.dtypes\n        v-->.memory_usage'

In [36]:
import pandas as pd

In [37]:
#i
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [38]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [39]:
#ii
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
#iii
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [41]:
#iv
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [42]:
#v
df.memory_usage()

Index           128
PassengerId    7128
Survived       7128
Pclass         7128
Name           7128
Sex            7128
Age            7128
SibSp          7128
Parch          7128
Ticket         7128
Fare           7128
Cabin          7128
Embarked       7128
dtype: int64

In [43]:
#2)
data={"A":[1,2,3],
    "B":[4,5,6],
    "C":[7,8,9]
}

In [44]:
df2=pd.DataFrame(data,index=[1,3,5])

In [45]:
df2

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

In [46]:
import logging

In [47]:
#3)
data={
      "Num":[1,2,3,4,5,6],
      "values":[1,4,9,16,25,36]
}

In [48]:
df3=pd.DataFrame(data)

In [49]:
df3

   Num  values
0    1       1
1    2       4
2    3       9
3    4      16
4    5      25
5    6      36

In [50]:
def test1(df):
    a=[]
    for i in df.index:
         a.append(df['values'][i])
    s=0
    for i in range(0,3):
        s=s+a[i]
    return "the sum of the first three values, which is ",s

In [51]:
a=test1(df3)

In [52]:
a

('the sum of the first three values, which is ', 14)

In [53]:
#4)
data1={
        "name":["jeeban jyoti","i am in B.tech "],
        "Text":["i am a studetnt","i am in B.tech "]
}

In [54]:
df4=pd.DataFrame(data1)

In [55]:
df4

              name             Text
0     jeeban jyoti  i am a studetnt
1  i am in B.tech   i am in B.tech

In [56]:
df4['Word_Count']=df4["Text"].apply(lambda x : len(x))

In [57]:
df4

              name             Text  Word_Count
0     jeeban jyoti  i am a studetnt          15
1  i am in B.tech   i am in B.tech           15

In [58]:
"""
5)Pandas .size, .shape are used to return size, shape and dimensions of data frames and series.
-->Dataframe.size-The . size property will return the size of a pandas DataFrame, which is the exact number of data cells in your DataFrame.
>syntax:-dataframe.size
-->Dataframe.shape-The shape property returns a tuple containing the shape of the DataFrame.
>syntax:-dataframe.shape
"""

'\n5)Pandas .size, .shape are used to return size, shape and dimensions of data frames and series.\n-->Dataframe.size-The . size property will return the size of a pandas DataFrame, which is the exact number of data cells in your DataFrame.\n>syntax:-dataframe.size\n-->Dataframe.shape-The shape property returns a tuple containing the shape of the DataFrame.\n>syntax:-dataframe.shape\n'

In [59]:
#6) -->pd.read_excel-- is used to read excel file

In [60]:
#7)
data2={
    "email":["jeeban.jyoti@gmail.com","jyoti.jeeban@gmail.com","jeeban69@gmail.com"]
}

In [61]:
df5=pd.DataFrame(data2)

In [88]:
df5

                    email      username
0  jeeban.jyoti@gmail.com  jeeban.jyoti
1  jyoti.jeeban@gmail.com  jyoti.jeeban
2      jeeban69@gmail.com      jeeban69

In [89]:
def test2(df):
    a1=[]
    for i in df5.index:
        a1.append(((df5["email"][i])))
    b=[]
    for i in a1:
        b=b+(i.split("@"))
    c=[]
    for j in b[::2]:
        c.append(j)
    return c

In [90]:
d=test2(df5)

In [91]:
df5["username"]=d

In [92]:
df5

                    email      username
0  jeeban.jyoti@gmail.com  jeeban.jyoti
1  jyoti.jeeban@gmail.com  jyoti.jeeban
2      jeeban69@gmail.com      jeeban69

In [93]:
"""
8)You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
"""

"\n8)You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects\nall rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The\nfunction should return a new DataFrame that contains only the selected rows.\n"

In [98]:
data2={
        "A":[3,8,6,2,9],
        "B":[5,2,9,3,1],
        "C":[1,7,4,5,2]
}

In [143]:
df6=pd.DataFrame(data2)

In [144]:
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [154]:
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [178]:
def test3(df):
    df_1=df[df6["A"]>5]
    df_2=df6[df6["B"]<10]
    df_3=pd.DataFrame(pd.merge(df_1,df_2))
    return df_3

In [179]:
a=test3(df6)

In [180]:
a

   A  B  C
0  8  2  7
1  6  9  4
2  9  1  2

In [184]:
"""
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.
"""

"\nQ9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,\nmedian, and standard deviation of the values in the 'Values' column.\n"

In [185]:
data3={
        "num":[12,23,43,10],
        "values":[144,529,1849,100]
}

In [186]:
df7=pd.DataFrame(data3)

In [187]:
df7

   num  values
0   12     144
1   23     529
2   43    1849
3   10     100

In [188]:
df7["values"].mean()

655.5

In [189]:
df7["values"].median()

336.5

In [190]:
df7["values"].std()

818.6690417989433

In [194]:
data4={
    "Date":["15-03-2023","16-03-2023","17-03-2023","18-03-2023","19-03-2023","20-03-2023","21-03-2023"],
    "sales":[234,654,345,755,2423,567,6456]
}

In [195]:
df8=pd.DataFrame(data4)

In [196]:
df8

         Date  sales
0  15-03-2023    234
1  16-03-2023    654
2  17-03-2023    345
3  18-03-2023    755
4  19-03-2023   2423
5  20-03-2023    567
6  21-03-2023   6456

In [218]:
df8["sales"].rolling(7,min_periods=1).mean()

0     234.000000
1     444.000000
2     411.000000
3     497.000000
4     882.200000
5     829.666667
6    1633.428571
Name: sales, dtype: float64

In [219]:
"""Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column."""

"Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new\ncolumn 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.\nMonday, Tuesday) corresponding to each date in the 'Date' column."

In [220]:
date=pd.date_range(start="2023-01-01", end="2023-01-05")

In [221]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05'],
              dtype='datetime64[ns]', freq='D')

In [222]:
df9=pd.DataFrame({"Date":date})

In [223]:
df9

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [254]:
def test_week(df):
    df["Day"]=df["Date"].dt.day
    df10=pd.DataFrame({"Weekday":['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thusrsday']})
    df11=pd.concat([df9,df10],axis=1)
    df11.drop(["Day"],axis=1,inplace=True)
    return df11

In [255]:
d=test_week(df9)

In [256]:
d

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05  Thusrsday

In [259]:
"""Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'."""

"Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python\nfunction to select all rows where the date is between '2023-01-01' and '2023-01-31'."

In [263]:
date2=pd.date_range(start="2023-01-01", end="2023-02-05")

TypeError: cannot convert dictionary update sequence element #0 to a sequence

In [260]:
df10=pd.DataFrame({"Date":date2})

In [261]:
df10

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31
31 2023-02-01
32 2023-02-02
33 2023-02-03
34 2023-02-04
35 2023-02-05

In [278]:
df10[(df10["Date"]>"2023-01-01") & (df10["Date"]<"2023-01-31")].index

Int64Index([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
            18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
           dtype='int64')